{
    "1": {
        "type": "announcement",
        "date": "2024-04-22 18:30:00",
        "version": "0.8.0",
        "title": "Initial internal release",
        "content": "This is the first internal version of Sandbox Elements.\n\nSandbox Elements is the successor to 2D Physics Sandbox. It improves on every aspect of the previous game, adding more content and variety in all directions. This first version is important for testing - [b]and your feedback will improve it[/b]. If you encounter any bugs or have suggestions, you can always send feedback via the Info menu → Send Feedback.\n\nSandbox Elements introduces a complete overhaul of elements, a new dynamic day/night cycle, weather system, dynamic fire and explosions, world themes, achievements, entities, quests, world sharing, shop and library, rules, event system and much more."
    },
    "3": {
        "type": "update",
        "date": "2024-04-25 21:30:00",
        "version": "0.8.1",
        "title": "First set of changes",
        "content": "- Fixed a door element interaction\n- Fixed a username issue in Community Worlds\n- Fixed a recurring world deletion bug\n- Fixed a bug where the World Title and Description were not saving from downloaded levels\n- Added a new \"Username\" field to the world upload dialog\n- Improved physics performance"
    },
    "4": {
        "type": "update",
        "date": "2024-04-28 21:35:00",
        "version": "0.8.2",
        "title": "General bug fixes and changes",
        "content": "- Added download count to community levels\n- Fixed finish element completing the level in sandbox or editor mode\n- Fixed downloading worlds without description or author\n- Fixed a bug where the rain was extinguishing elements in disabled mode\n- Display news reversed in news menu (newest first)\n- Display version numbers clearer\n- Reduced the chance of burning chickens turning into roasted chickens to 30%\n- Reduced the coin reward amount of the Global Explorer achievement and changed the unlock behavior\n- News button can now be clicked to reestablish a connection in case of connection failure\n- Elements can now burn in edit mode"
    },
    "5": {
        "type": "update",
        "date": "2024-05-01 21:30:00",
        "version": "0.8.3",
        "title": "Many small fixes and changes towards a larger goal",
        "content": "- Added a warning for events which have no triggers\n- Added a warning for uncompletable quest levels due to missing finish elements or level complete event actions\n- Fixed spawning throwable elements while grid is active\n- Fixed decoration elements colliding with other elements after dragging with the selector tool\n- Fixed lightning strikes appearing while game is paused\n- Fixed teleporter and finish element appearing in front of other elements\n- Fixed formatting issues with the level completion text\n- Fixed a crash when failing a level\n- Reduced ad frequency in the main menu and the reward for it to 10 coins\n- Reduced random coin clatter sounds which played in the background\n- Added short descriptions and new images to the game mode buttons in the world creation menu\n- The name field is now required in the world creation menu\n- The pre-release popup now appears after the splash screen"
    },
    "6": {
        "type": "update",
        "date": "2024-05-07 14:00:00",
        "version": "0.8.4",
        "title": "Improved performance of grass elements",
        "content": "This update improves the loading speed of grass elements by ≈ 98%:\n[table=4][cell border=gray]Elements[/cell][cell border=gray]Before (v0.8.3)[/cell][cell border=gray]After (v0.8.4)[/cell][cell border=gray]Percentage difference[/cell][cell border=gray][right]10 Grass Elements[/right][/cell][cell border=gray][right]94.66ms[/right][/cell][cell border=gray][right]2.43ms[/right][/cell][cell border=gray][right]≈ 97.49%[/right][/cell][cell border=gray][right]400 Grass Elements[/right][/cell][cell border=gray][right]14282.73ms[/right][/cell][cell border=gray][right]171.49ms[/right][/cell][cell border=gray][right]≈ 98.72%[/right][/cell][/table]\n\nOther changes:\n- Fixed chicken elements not laying eggs\n- Clouds now appear slightly brighter\n- Updated localizations, popup animations, sounds and layouts\n- Elements are no longer deleted when exiting or reloading a level\n- Removed Games and Reddit tabs from the info menu\n- Removed a background layer from the Grasslands world theme"
    },
    "7": {
        "type": "update",
        "date": "2024-05-31 19:30:00",
        "version": "0.8.5",
        "title": "New menu layout and element changes",
        "content": "- New menu and world layout in the sandbox and world selection menu\n- Finish element is automatically unlocked and can now only be used in editor mode\n- Fixed wooden door element not having collision after being moved\n- Removed \"coin changed\" event trigger\n- Reduced achievement unlock sound volume\n- Settings menu categorized into groups\n- \"Not selectable\" elements are now selectable in edit mode\n- Sign, wooden door, boxing glove, domino and bouncy ball can now burn\n- Browse menu opens \"newest\" tab instead of \"downloaded\" in community worlds\n- Updated localizations"
    },
    "8": {
        "type": "update",
        "date": "2024-07-23 22:30:00",
        "version": "0.9.0",
        "title": "New Pixel Art Icons, Quest Mode Overhaul and new capabilities",
        "content": "- [b][color=red]Removed the \"sandbox\" game mode[/color][/b]. All previously created sandbox levels are now (as previously known) \"quest\" levels. This allows for greater change and editing capabilities of your levels and splits your levels into a play and edit mode.\n- A complete overhaul of every icon. All icons are now in pixel art, providing a new unique and more consistent look for the entire game! The font and size of titles and labels have also been adjusted.\n- The speed of time can now be changed in the world menu. This allows you to speed up or slow down the time of your world and make the day/night cycle slower or faster.\n- Tabs are now centered in the world and settings menu.\n- Condition groups in events have been removed. Only a single type of condition can now be added to events. This makes the usage of conditions in events easier to use and the flow easier to understand. All previously created condition groups and conditions are automatically converted into a list of conditions.\n- Removed the utility and liquid element categories.\n- Renamed the \"Basic\" element category to \"Physics\".\n- <<element:domino>>, <<element:player>>, and <<element:teleporter>> are now 1 block tall (50% smaller).\n- <<element:mushroom>>, <<element:balloon>>, <<element:boar>>, <<element:chicken>>, <<element:egg>>, <<element:basketball>>, <<element:bouncy_ball>>, <<element:pencil>>, and <<element:paint_brush>> are now 25% smaller.\n- <<element:booster>> has been removed.\n- Icons can now be shown inside texts.\n- Reduced the volume of birds in the Grasslands world theme.\n- Removed the \"time\" condition for events.\n- Adjusted the level creation, world edit, info, and events menus."
    }
}
